# 按照要求完成以下练习

# 1. 在终端中分别录入3个数据(分钟数、小时数、天数)， 输出总秒数




# 2. 古代的秤一斤有16两，请在终端中获取两，计算是几斤零几两。
# 输入：100
# 输出：6斤零4两




# 3. 在终端中获取一个四位整数，计算每位相加和。
# 输入:1234
# 输出:10




# 4. ​在终端中录入年份，判断是否为闰年。
# ​满足闰年条件1：年份能被4整除，但是不能被100整除。
# ​满足闰年条件2：能被400整除。




# 5. 在控制台中获取一个季度，打印相应的月份。
# 输入与输出：
#   春    1月2月3月
#   夏    4月5月6月
#   秋    7月8月9月
#   冬    10月11月12月




# 6. 在终端中依次录入4个同学体重，打印最重的值。
# 思路：
#     假设第一个就是最大的.
#     使用假设的依次与后几个变量进行比较,如果发现更大的，则替换假设的。
# 输入：52、40、37、60
# 输出：60




# 7. 在终端中录入月份，然后打印天数。
# 输入：2 输出：28天
# 输入：1 3 5 7 8 10 12 输出：31天
# 输入：4 6 9 11 输出： 30天




# 8. 在控制台中输出以下内容：
# 在控制台中输出：0 1 2 3 4 5
# 在控制台中输出：2 3 4 5 6 7
# 在控制台中输出：0 2 4 6
# 在控制台中输出：4 3 2 1 0
# 在控制台中输出：-1  -2  -3  -4




# 9. 在控制台中，获取一个开始值，一个结束值。
# 将中间的数字打印出来。
# 输入：3           9
# 输出：  4 5 6 7 8




# 10. 一张纸的厚度是0.01毫米，请计算对折多少次，超过珠穆朗玛峰8844.43米。
# 答案：30次




# 11. 游戏运行产生一个１－－１００之间的随机数。
# 让玩家重复猜测，直到猜对为止。
# 输出:大了、小了、猜对了，总共猜了多少次。
# 提示：随机数工具(在开头写一次)
# import random
# 产生一个随机数
#random_number = random.randint(1, 100)




# 12. 在终端中获取任意整数，累加每位数字。
# 输入：“12345”
# 输出：15           使用for循环完成




# 13. 循环累加练习
# 循环累加下列数字的和：0 1 2 3 4 5
# 循环累加下列数字的和： 2 3 4 5 6 7
# 循环累加下列数字的和： 0 2 4 6
# 循环累加下列数字的和： 4 3 2 1 0
# 循环累加下列数字的和： -1  -2  -3  -4      使用for循环完成




# 14. 累加10-50之间个位不是2,5,9的整数和.




# 15. 按要求打印以下内容·
# 1.创建字符串：人生苦短,我学Python
# 2.打印第一个字符，最后一个字符。
# 3.打印前两个字符，后六个字符。
# 4.打印中间一个字符。
# 5.倒序打印所有字符。




# 16. 在控制台中获取一个整数作为边长，打印矩形。
# 输入：4
# 输出：
#     ****
#     *  *
#     *  *
#     ****




# 17. 在控制台中循环录入同学们的身高，如果输入空，则停止。
# 打印所有人的身高(一行一个)。
# 打印总数。
# 打印最高、最低、和平均的身高。
# 使用 max   min    sum




# 18. 在终端中循环录入字符串，如果输入空则停止。
# 最后打印所有的内容(拼接后的字符串)




# 19. 将英文单词翻转。
# 输入：How are you
# 输出：you are How




# 20. 在控制台中录入日期(月日)，计算是这一年的第几天。
# 例如：
#        3月15日 --> 31 + 28 + 15
#        5月20日 --> 31 + 28 + 31 + 30 + 20




# 21. 计算字符串中每个字符出现次数。
# 输入：abcbdeacb
# 输出：
#     字符a,2次
#     字符b,3次
#     字符c,2次
#     字符d,1次
#     字符e,1次




# 22. 在控制台中循环录入学生信息(名称、性别、年龄、成绩)，如果名称录入为空，则停止录入。
# 最后打印所有学生信息(一行一个)。
# 数据结构：
# [
#   {"name":"悟空","sex":"男","age":23,"score":100}
# ]



# 23. 在控制台中循环录入多个人的多个喜好，如果名称录入为空，则停止录入。
# 最后打印所有信息。
# 数据结构：
# {
#    "于谦":["抽烟","喝酒","烫头"]
# }



# 24. 将两个列表合并为一个字典。
# 输入：["张无忌","赵敏","周芷若"] [101,102,103]
# 输出：{"张无忌":101,"赵敏":102,"周芷若":103}




# 25. 自定义排序算法，对列表进行升序排列。
# 思路：
#     依次取出元素，与后面进行比较。
#     发现更小的，则交换。
# 输入：[2,8,6,1]
# 输出：[1,2,6,8]




# 26. 定义函数，计算多位整数每位相加和.
# 输入：12345
# 输出：15




# 27. 定义函数，根据成绩计算等级。
# ​    输入：96
# ​    输出：优秀
# ​    输入：85
# ​    输出：良好
# ​    输入：60
# ​    输出：及格
# ​    输入：50
# ​    输出：不及格




# 28. 定义函数，判断列表中是否存在相同元素
# 输入：[3,4,6,8,6]
# 输出：True


